In [24]:
#https://www.datacamp.com/community/tutorials/sql-interface-within-jupyterlab
#https://pypi.org/project/ipython-sql/
#https://trvrm.github.io/sql-magic.html
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [25]:
#Use this for in memory processing 
#%%sql sqlite://
#Connecting to a specific database
%sql sqlite:///College.db

'Connected: @College.db'

In [26]:
%%sql
SELECT * FROM Apply

 * sqlite:///College.db
Done.

[(123, 'Stanford', 'CS', 'Y'),
 (123, 'Stanford', 'EE', 'N'),
 (123, 'Berkeley', 'CS', 'Y'),
 (123, 'Cornell', 'EE', 'Y'),
 (234, 'Berkeley', 'biology', 'N'),
 (345, 'MIT', 'bioengineering', 'Y'),
 (345, 'Cornell', 'bioengineering', 'N'),
 (345, 'Cornell', 'CS', 'Y'),
 (345, 'Cornell', 'EE', 'N'),
 (678, 'Stanford', 'history', 'Y'),
 (987, 'Stanford', 'CS', 'Y'),
 (987, 'Berkeley', 'CS', 'Y'),
 (876, 'Stanford', 'CS', 'N'),
 (876, 'MIT', 'biology', 'Y'),
 (876, 'MIT', 'marine biology', 'N'),
 (765, 'Stanford', 'history', 'Y'),
 (765, 'Cornell', 'history', 'N'),
 (765, 'Cornell', 'psychology', 'Y'),
 (543, 'MIT', 'CS', 'N')]

In [30]:
%%sql
pd.read_sql(select * from College)

 * sqlite:///College.db
(sqlite3.OperationalError) near "pd": syntax error
[SQL: pd.read_sql(select * from College)]
(Background on this error at: http://sqlalche.me/e/e3q8)